app/Controllers/Customer.php

SELECT *
FROM `customer`
WHERE `customer`.`id` = '17'
---
    public function profile()
    {
        // Cek apakah user sudah login
        if (!$this->session->get('customer_logged_in')) {
            return redirect()->to(base_url('login-customer'));
        }

        // Ambil data customer dari database
        $customerId = $this->session->get('customer_id');
        $customer = $this->customerModel->find($customerId);