app/Controllers/Keranjang.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        // Cek apakah user sudah login
        if (!$this->session->get('customer_logged_in')) {
            return redirect()->to(base_url('login-customer'));
        }

        $customer_id = $this->session->get('customer_id');
        $data = [
            'title' => 'Keranjang Saya',
            'keranjang' => $this->keranjangModel->getKeranjangByCustomer($customer_id),
            'total_harga' => $this->keranjangModel->getTotalHarga($customer_id),
            'kategori' => $this->kategoriModel->findAll(), // Add kategori data

SELECT *
FROM `produk`
WHERE `produk`.`id` = '35'
---
    public function add()
    {
        // Cek apakah user sudah login
        if (!$this->session->get('customer_logged_in')) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Silakan login terlebih dahulu'
            ]);
        }

        $produk_id = $this->request->getPost('produk_id');
        $jumlah = $this->request->getPost('jumlah') ?? 1;
        $customer_id = $this->session->get('customer_id');

        // Validasi produk
        $produk = $this->produkModel->find($produk_id);