app/Controllers/User.php

    public function index(): string
    {
        // Ambil parameter pencarian dan filter
        $search = $this->request->getGet('search');
        $kategori_id = $this->request->getGet('kategori');
        $sort = $this->request->getGet('sort');

        // Ambil data produk dengan filter
        $produk = $this->produkModel->getProdukWithKategori(null, $search, $kategori_id, $sort);

        // Ambil semua kategori untuk dropdown
        $kategori = $this->kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function allProduct(): string
    {
        // Ambil parameter pencarian dan filter
        $search = $this->request->getGet('search');
        $kategori_id = $this->request->getGet('kategori');
        $sort = $this->request->getGet('sort');

        // Ambil data produk dengan filter
        $produk = $this->produkModel->getProdukWithKategori(null, $search, $kategori_id, $sort);

        // Ambil semua kategori untuk dropdown
        $kategori = $this->kategoriModel->findAll();
---
SELECT *
FROM `kategori`