app/Models/KeranjangModel.php

    public function getKeranjangByCustomer($customer_id)
    {
        return $this->db->table($this->table)
                    ->select('keranjang.*, produk.nama, produk.harga, produk.foto')
                    ->join('produk', 'produk.id = keranjang.produk_id')
                    ->where('keranjang.customer_id', $customer_id)
                    ->get()
                    ->getResultArray();
---
SELECT `keranjang`.*, `produk`.`nama`, `produk`.`harga`, `produk`.`foto`
FROM `keranjang`
JOIN `produk` ON `produk`.`id` = `keranjang`.`produk_id`
WHERE `keranjang`.`customer_id` = '17'

    public function addToKeranjang($data)
    {
        // Cek apakah produk sudah ada di keranjang
        $existing = $this->where('customer_id', $data['customer_id'])
                        ->where('produk_id', $data['produk_id'])
                        ->first();

        if ($existing) {
            // Update jumlah jika sudah ada
            return $this->update($existing['id'], [
                'jumlah' => $existing['jumlah'] + $data['jumlah']
            ]);
---
SELECT *
FROM `keranjang`
WHERE `customer_id` = '17'
AND `produk_id` = '35'
 LIMIT 1
UPDATE `keranjang` SET `jumlah` = 2
WHERE `keranjang`.`id` IN ('60')

    public function getTotalHarga($customer_id)
    {
        $result = $this->db->table($this->table)
                          ->select('SUM(keranjang.jumlah * produk.harga) as total')
                        ->join('produk', 'produk.id = keranjang.produk_id')
                        ->where('keranjang.customer_id', $customer_id)
                        ->get()
                        ->getRowArray();
---
SELECT SUM(keranjang.jumlah * produk.harga) as total
FROM `keranjang`
JOIN `produk` ON `produk`.`id` = `keranjang`.`produk_id`
WHERE `keranjang`.`customer_id` = '17'

    public function getJumlahItem($customer_id)
    {
        $result = $this->where('customer_id', $customer_id)
                    ->selectSum('jumlah', 'total_quantity')
                    ->get()
                    ->getRow();
---
SELECT SUM(`jumlah`) AS `total_quantity`
FROM `keranjang`
WHERE `customer_id` = '17'